stm32duino/LIS2DUXS12/src/lis2duxs12_reg.h
/*
 * These are the basic platform dependent I/O routines to read
 * and write device registers connected on a standard bus.
 * The driver keeps offering a default implementation based on function
 * pointers to read/write routines for backward compatibility.
 * The __weak directive allows the final application to overwrite
 * them with a custom implementation.
 */

int32_t lis2duxs12_read_reg(lis2duxs12_ctx_t *ctx, uint8_t reg,
                            uint8_t *data,
                            uint16_t len);
int32_t lis2duxs12_write_reg(lis2duxs12_ctx_t *ctx, uint8_t reg,
                             uint8_t *data,
                             uint16_t len);

float_t lis2duxs12_from_fs2g_to_mg(int16_t lsb);
float_t lis2duxs12_from_fs4g_to_mg(int16_t lsb);
float_t lis2duxs12_from_fs8g_to_mg(int16_t lsb);
float_t lis2duxs12_from_fs16g_to_mg(int16_t lsb);
float_t lis2duxs12_from_lsb_to_celsius(int16_t lsb);
float_t lis2duxs12_from_lsb_to_mv(int16_t lsb);

int32_t lis2duxs12_device_id_get(lis2duxs12_ctx_t *ctx, uint8_t *val);

typedef enum {
  LIS2DUXS12_SENSOR_ONLY_ON     = 0x00, /* Initialize the driver for sensor usage */
  LIS2DUXS12_BOOT               = 0x01, /* Restore calib. param. (it takes 10ms) */
  LIS2DUXS12_RESET              = 0x02, /* Reset configuration registers */
  LIS2DUXS12_SENSOR_EMB_FUNC_ON = 0x03, /* Initialize the driver for sensor and/or
                                           embedded functions usage (it takes 10ms) */
} lis2duxs12_init_t;
int32_t lis2duxs12_init_set(lis2duxs12_ctx_t *ctx, lis2duxs12_init_t val);

typedef struct {
  uint8_t sw_reset                     : 1; /* Restoring configuration registers */
  uint8_t boot                         : 1; /* Restoring calibration parameters */
  uint8_t drdy                         : 1; /* Accelerometer data ready */
  uint8_t power_down                   : 1; /* Monitors power-down. */
} lis2duxs12_status_t;
int32_t lis2duxs12_status_get(lis2duxs12_ctx_t *ctx, lis2duxs12_status_t *val);

typedef struct {
  uint8_t is_step_det                  : 1; /* Step detected */
  uint8_t is_tilt                      : 1; /* Tilt detected */
  uint8_t is_sigmot                    : 1; /* Significant motion detected */
} lis2duxs12_embedded_status_t;
int32_t lis2duxs12_embedded_status_get(lis2duxs12_ctx_t *ctx, lis2duxs12_embedded_status_t *val);

typedef enum {
  LIS2DUXS12_DRDY_LATCHED = 0x0,
  LIS2DUXS12_DRDY_PULSED  = 0x1,
} lis2duxs12_data_ready_mode_t;
int32_t lis2duxs12_data_ready_mode_set(lis2duxs12_ctx_t *ctx, lis2duxs12_data_ready_mode_t val);
int32_t lis2duxs12_data_ready_mode_get(lis2duxs12_ctx_t *ctx, lis2duxs12_data_ready_mode_t *val);

typedef enum {
  LIS2DUXS12_OFF               = 0x00, /* in power down */
  LIS2DUXS12_1Hz6_ULP          = 0x01, /* @1Hz6 (ultra low power) */
  LIS2DUXS12_3Hz_ULP           = 0x02, /* @3Hz (ultra low power) */
  LIS2DUXS12_25Hz_ULP          = 0x03, /* @25Hz (ultra low power) */
  LIS2DUXS12_6Hz_LP            = 0x04, /* @6Hz (low power) */
  LIS2DUXS12_12Hz5_LP          = 0x05, /* @12Hz5 (low power) */
  LIS2DUXS12_25Hz_LP           = 0x06, /* @25Hz  (low power ) */
  LIS2DUXS12_50Hz_LP           = 0x07, /* @50Hz  (low power) */
  LIS2DUXS12_100Hz_LP          = 0x08, /* @100Hz (low power) */
  LIS2DUXS12_200Hz_LP          = 0x09, /* @200Hz (low power) */
  LIS2DUXS12_400Hz_LP          = 0x0A, /* @400Hz (low power) */
  LIS2DUXS12_800Hz_LP          = 0x0B, /* @800Hz (low power) */
  LIS2DUXS12_6Hz_HP            = 0x14, /* @6Hz (high performance) */
  LIS2DUXS12_12Hz5_HP          = 0x15, /* @12Hz5 (high performance) */
  LIS2DUXS12_25Hz_HP           = 0x16, /* @25Hz  (high performance ) */
  LIS2DUXS12_50Hz_HP           = 0x17, /* @50Hz  (high performance) */
  LIS2DUXS12_100Hz_HP          = 0x18, /* @100Hz (high performance) */
  LIS2DUXS12_200Hz_HP          = 0x19, /* @200Hz (high performance) */
  LIS2DUXS12_400Hz_HP          = 0x1A, /* @400Hz (high performance) */
  LIS2DUXS12_800Hz_HP          = 0x1B, /* @800Hz (high performance) */
  LIS2DUXS12_TRIG_PIN          = 0x2E, /* Single-shot high latency by INT2 */
  LIS2DUXS12_TRIG_SW           = 0x2F, /* Single-shot high latency by IF */
} lis2duxs12_odr_t;

typedef enum {
  LIS2DUXS12_2g   = 0,
  LIS2DUXS12_4g   = 1,
  LIS2DUXS12_8g   = 2,
  LIS2DUXS12_16g  = 3,
} lis2duxs12_fs_t;

typedef enum {
  LIS2DUXS12_ODR_div_2   = 0,
  LIS2DUXS12_ODR_div_4   = 1,
  LIS2DUXS12_ODR_div_8   = 2,
  LIS2DUXS12_ODR_div_16  = 3,
} lis2duxs12_bw_t;

typedef struct {
  lis2duxs12_odr_t odr;
  lis2duxs12_fs_t fs;
  lis2duxs12_bw_t bw;
} lis2duxs12_md_t;
int32_t lis2duxs12_mode_set(lis2duxs12_ctx_t *ctx, lis2duxs12_md_t *val);
int32_t lis2duxs12_mode_get(lis2duxs12_ctx_t *ctx, lis2duxs12_md_t *val);

int32_t lis2duxs12_trigger_sw(lis2duxs12_ctx_t *ctx, lis2duxs12_md_t *md);

typedef struct {
  uint8_t drdy                         : 1;
  uint8_t timestamp                    : 1;
  uint8_t free_fall                    : 1;
  uint8_t wake_up                      : 1;
  uint8_t wake_up_z                    : 1;
  uint8_t wake_up_y                    : 1;
  uint8_t wake_up_x                    : 1;
  uint8_t single_tap                   : 1;
  uint8_t double_tap                   : 1;
  uint8_t triple_tap                   : 1;
  uint8_t six_d                        : 1;
  uint8_t six_d_xl                     : 1;
  uint8_t six_d_xh                     : 1;
  uint8_t six_d_yl                     : 1;
  uint8_t six_d_yh                     : 1;
  uint8_t six_d_zl                     : 1;
  uint8_t six_d_zh                     : 1;
  uint8_t sleep_change                 : 1;
  uint8_t sleep_state                  : 1;
  uint8_t tilt                         : 1;
  uint8_t fifo_bdr                     : 1;
  uint8_t fifo_full                    : 1;
  uint8_t fifo_ovr                     : 1;
  uint8_t fifo_th                      : 1;
} lis2duxs12_all_sources_t;
int32_t lis2duxs12_all_sources_get(lis2duxs12_ctx_t *ctx, lis2duxs12_all_sources_t *val);

