stm32duino/LIS2DUXS12/src/lis2duxs12_reg.h
typedef struct {
  float_t mg[3];
  int16_t raw[3];
} lis2duxs12_xl_data_t;
int32_t lis2duxs12_xl_data_get(lis2duxs12_ctx_t *ctx, lis2duxs12_md_t *md,
                               lis2duxs12_xl_data_t *data);

typedef struct {
  struct {
    float_t deg_c;
    int16_t raw;
  } heat;
} lis2duxs12_outt_data_t;
int32_t lis2duxs12_outt_data_get(lis2duxs12_ctx_t *ctx, lis2duxs12_md_t *md,
                                 lis2duxs12_outt_data_t *data);

typedef struct {
  float_t mv;
  int16_t raw;
} lis2duxs12_ah_qvar_data_t;
int32_t lis2duxs12_ah_qvar_data_get(lis2duxs12_ctx_t *ctx, lis2duxs12_md_t *md,
                                    lis2duxs12_ah_qvar_data_t *data);

typedef enum {
  LIS2DUXS12_XL_ST_DISABLE  = 0x0,
  LIS2DUXS12_XL_ST_POSITIVE = 0x1,
  LIS2DUXS12_XL_ST_NEGATIVE = 0x2,
} lis2duxs12_xl_self_test_t;
int32_t lis2duxs12_self_test_sign_set(lis2duxs12_ctx_t *ctx, lis2duxs12_xl_self_test_t val);
int32_t lis2duxs12_self_test_start(lis2duxs12_ctx_t *ctx, uint8_t val);
int32_t lis2duxs12_self_test_stop(lis2duxs12_ctx_t *ctx);

int32_t lis2duxs12_enter_deep_power_down(lis2duxs12_ctx_t *ctx, uint8_t val);
int32_t lis2duxs12_exit_deep_power_down(lis2duxs12_ctx_t *ctx);

typedef enum {
  LIS2DUXS12_I3C_BUS_AVAIL_TIME_20US = 0x0,
  LIS2DUXS12_I3C_BUS_AVAIL_TIME_50US = 0x1,
  LIS2DUXS12_I3C_BUS_AVAIL_TIME_1MS  = 0x2,
  LIS2DUXS12_I3C_BUS_AVAIL_TIME_25MS = 0x3,
} lis2duxs12_bus_act_sel_t;

typedef struct {
  lis2duxs12_bus_act_sel_t bus_act_sel;
  uint8_t asf_on                       : 1;
  uint8_t drstdaa_en                   : 1;
} lis2duxs12_i3c_cfg_t;
int32_t lis2duxs12_i3c_configure_set(lis2duxs12_ctx_t *ctx, lis2duxs12_i3c_cfg_t *val);
int32_t lis2duxs12_i3c_configure_get(lis2duxs12_ctx_t *ctx, lis2duxs12_i3c_cfg_t *val);

typedef enum {
  LIS2DUXS12_MAIN_MEM_BANK       = 0x0,
  LIS2DUXS12_EMBED_FUNC_MEM_BANK = 0x1,
} lis2duxs12_mem_bank_t;
int32_t lis2duxs12_mem_bank_set(lis2duxs12_ctx_t *ctx, lis2duxs12_mem_bank_t val);
int32_t lis2duxs12_mem_bank_get(lis2duxs12_ctx_t *ctx, lis2duxs12_mem_bank_t *val);

int32_t lis2duxs12_ln_pg_write(lis2duxs12_ctx_t *ctx, uint16_t address, uint8_t *buf, uint8_t len);
int32_t lis2duxs12_ln_pg_read(lis2duxs12_ctx_t *ctx, uint16_t address, uint8_t *buf, uint8_t len);

typedef struct {
  uint8_t sdo_pull_up                  : 1; /* 1 = pull up enable */
  uint8_t sda_pull_up                  : 1; /* 1 = pull up enable */
  uint8_t cs_pull_up                   : 1; /* 1 = pull up enable */
  uint8_t int1_int2_push_pull          : 1; /* 1 = push-pull / 0 = open-drain*/
  uint8_t int1_pull_down               : 1; /* 1 = pull-down always disabled (0=auto) */
  uint8_t int2_pull_down               : 1; /* 1 = pull-down always disabled (0=auto) */
} lis2duxs12_pin_conf_t;
int32_t lis2duxs12_pin_conf_set(lis2duxs12_ctx_t *ctx, lis2duxs12_pin_conf_t *val);
int32_t lis2duxs12_pin_conf_get(lis2duxs12_ctx_t *ctx, lis2duxs12_pin_conf_t *val);

typedef enum {
  LIS2DUXS12_ACTIVE_HIGH = 0x0,
  LIS2DUXS12_ACTIVE_LOW  = 0x1,
} lis2duxs12_int_pin_polarity_t;
int32_t lis2duxs12_int_pin_polarity_set(lis2duxs12_ctx_t *ctx, lis2duxs12_int_pin_polarity_t val);
int32_t lis2duxs12_int_pin_polarity_get(lis2duxs12_ctx_t *ctx, lis2duxs12_int_pin_polarity_t *val);

typedef enum {
  LIS2DUXS12_SPI_4_WIRE  = 0x0, /* SPI 4 wires */
  LIS2DUXS12_SPI_3_WIRE  = 0x1, /* SPI 3 wires */
} lis2duxs12_spi_mode;
int32_t lis2duxs12_spi_mode_set(lis2duxs12_ctx_t *ctx, lis2duxs12_spi_mode val);
int32_t lis2duxs12_spi_mode_get(lis2duxs12_ctx_t *ctx, lis2duxs12_spi_mode *val);

typedef struct {
  uint8_t int_on_res                   : 1; /* Interrupt on RES pin */
  uint8_t drdy                         : 1; /* Accelerometer data ready */
  uint8_t boot                         : 1; /* Restoring calibration parameters */
  uint8_t fifo_th                      : 1; /* FIFO threshold reached */
  uint8_t fifo_ovr                     : 1; /* FIFO overrun */
  uint8_t fifo_full                    : 1; /* FIFO full */
  uint8_t free_fall                    : 1; /* free fall event */
  uint8_t six_d                        : 1; /* orientation change (6D/4D detection) */
  uint8_t tap                          : 1; /* all tap event */
  uint8_t wake_up                      : 1; /* wake up event */
  uint8_t sleep_change                 : 1; /* Act/Inact (or Vice-versa) status changed */
  uint8_t emb_function                 : 1; /* Embedded Function */
  uint8_t timestamp                    : 1; /* Timestamp */
} lis2duxs12_pin_int_route_t;
int32_t lis2duxs12_pin_int1_route_set(lis2duxs12_ctx_t *ctx,
                                      lis2duxs12_pin_int_route_t *val);
int32_t lis2duxs12_pin_int1_route_get(lis2duxs12_ctx_t *ctx,
                                      lis2duxs12_pin_int_route_t *val);
int32_t lis2duxs12_pin_int2_route_set(lis2duxs12_ctx_t *ctx,
                                      lis2duxs12_pin_int_route_t *val);
int32_t lis2duxs12_pin_int2_route_get(lis2duxs12_ctx_t *ctx,
                                      lis2duxs12_pin_int_route_t *val);

typedef struct {
  uint8_t step_det                     : 1; /* route step detection event on INT pad */
  uint8_t tilt                         : 1; /* route tilt event on INT pad */
  uint8_t sig_mot                      : 1; /* route significant motion event on INT pad */
  uint8_t fsm_lc                       : 1; /* route FSM long counter event on INT pad */
} lis2duxs12_emb_pin_int_route_t;
int32_t lis2duxs12_emb_pin_int1_route_set(lis2duxs12_ctx_t *ctx,
                                          lis2duxs12_emb_pin_int_route_t *val);
int32_t lis2duxs12_emb_pin_int1_route_get(lis2duxs12_ctx_t *ctx,
                                          lis2duxs12_emb_pin_int_route_t *val);
int32_t lis2duxs12_emb_pin_int2_route_set(lis2duxs12_ctx_t *ctx,
                                          lis2duxs12_emb_pin_int_route_t *val);
int32_t lis2duxs12_emb_pin_int2_route_get(lis2duxs12_ctx_t *ctx,
                                          lis2duxs12_emb_pin_int_route_t *val);

