stm32duino/LIS2DUXS12/src/lis2duxs12_reg.h
typedef enum {
  LIS2DUXS12_INT_DISABLED             = 0x0,
  LIS2DUXS12_INT_LEVEL                = 0x1,
  LIS2DUXS12_INT_LATCHED              = 0x2,
} lis2duxs12_int_cfg_t;

typedef struct {
  lis2duxs12_int_cfg_t int_cfg;
  uint8_t sleep_status_on_int          : 1;  /* route sleep_status on interrupt */
  uint8_t dis_rst_lir_all_int          : 1;  /* disable LIR reset when reading ALL_INT_SRC */
} lis2duxs12_int_config_t;
int32_t lis2duxs12_int_config_set(lis2duxs12_ctx_t *ctx, lis2duxs12_int_config_t *val);
int32_t lis2duxs12_int_config_get(lis2duxs12_ctx_t *ctx, lis2duxs12_int_config_t *val);

typedef enum {
  LIS2DUXS12_EMBEDDED_INT_LEVEL         = 0x0,
  LIS2DUXS12_EMBEDDED_INT_LATCHED       = 0x1,
} lis2duxs12_embedded_int_config_t;
int32_t lis2duxs12_embedded_int_config_set(lis2duxs12_ctx_t *ctx, lis2duxs12_embedded_int_config_t val);
int32_t lis2duxs12_embedded_int_config_get(lis2duxs12_ctx_t *ctx, lis2duxs12_embedded_int_config_t *val);

typedef enum {
  LIS2DUXS12_BYPASS_MODE              = 0x0,
  LIS2DUXS12_FIFO_MODE                = 0x1,
  LIS2DUXS12_STREAM_TO_FIFO_MODE      = 0x3,
  LIS2DUXS12_BYPASS_TO_STREAM_MODE    = 0x4,
  LIS2DUXS12_STREAM_MODE              = 0x6,
  LIS2DUXS12_BYPASS_TO_FIFO_MODE      = 0x7,
  LIS2DUXS12_FIFO_OFF                 = 0x8,
} lis2duxs12_operation_t;

typedef enum {
  LIS2DUXS12_FIFO_1X                  = 0,
  LIS2DUXS12_FIFO_2X                  = 1,
} lis2duxs12_store_t;

typedef enum {
  LIS2DUXS12_DEC_TS_OFF             = 0x0,
  LIS2DUXS12_DEC_TS_1               = 0x1,
  LIS2DUXS12_DEC_TS_8               = 0x2,
  LIS2DUXS12_DEC_TS_32              = 0x3,
} lis2duxs12_dec_ts_t;

typedef enum {
  LIS2DUXS12_BDR_XL_ODR             = 0x0,
  LIS2DUXS12_BDR_XL_ODR_DIV_2       = 0x1,
  LIS2DUXS12_BDR_XL_ODR_DIV_4       = 0x2,
  LIS2DUXS12_BDR_XL_ODR_DIV_8       = 0x3,
  LIS2DUXS12_BDR_XL_ODR_DIV_16      = 0x4,
  LIS2DUXS12_BDR_XL_ODR_DIV_32      = 0x5,
  LIS2DUXS12_BDR_XL_ODR_DIV_64      = 0x6,
  LIS2DUXS12_BDR_XL_ODR_OFF         = 0x7,
} lis2duxs12_bdr_xl_t;

typedef struct {
  lis2duxs12_operation_t operation;
  lis2duxs12_store_t store;
  uint8_t xl_only                      : 1; /* when set to 1, only XL samples (16-bit) are stored in FIFO */
  uint8_t watermark                    : 7; /* (0 disable) max 127 @16bit, even and max 256 @8bit.*/
  uint8_t cfg_change_in_fifo           : 1;
  struct {
    lis2duxs12_dec_ts_t dec_ts; /* decimation for timestamp batching*/
    lis2duxs12_bdr_xl_t bdr_xl; /* accelerometer batch data rate*/
  } batch;
} lis2duxs12_fifo_mode_t;
int32_t lis2duxs12_fifo_mode_set(lis2duxs12_ctx_t *ctx, lis2duxs12_fifo_mode_t val);
int32_t lis2duxs12_fifo_mode_get(lis2duxs12_ctx_t *ctx, lis2duxs12_fifo_mode_t *val);

int32_t lis2duxs12_fifo_data_level_get(lis2duxs12_ctx_t *ctx, uint16_t *val);
int32_t lis2duxs12_fifo_wtm_flag_get(lis2duxs12_ctx_t *ctx, uint8_t *val);

typedef enum {
  LIS2DUXS12_FIFO_EMPTY                 = 0x0,
  LIS2DUXS12_XL_TEMP_TAG                = 0x2,
  LIS2DUXS12_XL_ONLY_2X_TAG             = 0x3,
  LIS2DUXS12_TIMESTAMP_TAG              = 0x4,
  LIS2DUXS12_STEP_COUNTER_TAG           = 0x12,
  LIS2DUXS12_MLC_RESULT_TAG             = 0x1A,
  LIS2DUXS12_MLC_FILTER_TAG             = 0x1B,
  LIS2DUXS12_MLC_FEATURE                = 0x1C,
  LIS2DUXS12_FSM_RESULT_TAG             = 0x1D,
  LIS2DUXS12_XL_ONLY_2X_TAG_2ND         = 0x1E,
  LIS2DUXS12_XL_AND_QVAR                = 0x1F,
} lis2duxs12_fifo_sensor_tag_t;
int32_t lis2duxs12_fifo_sensor_tag_get(lis2duxs12_ctx_t *ctx,
                                       lis2duxs12_fifo_sensor_tag_t *val);

int32_t lis2duxs12_fifo_out_raw_get(lis2duxs12_ctx_t *ctx, uint8_t *buff);

typedef struct {
  uint8_t tag;
  struct {
    float_t mg[3];
    int16_t raw[3];
  } xl[2];
  struct {
    float_t mv;
    int16_t raw;
  } ah_qvar;
  struct {
    float_t deg_c;
    int16_t raw;
  } heat;
  struct lis2duxs12_pedo {
    uint32_t steps;
    uint32_t timestamp;
  } pedo;
  struct lis2duxs12_cfg_chg {
    uint8_t cfg_change                 : 1; /* 1 if ODR/BDR configuration is changed */
    uint8_t odr                        : 4; /* ODR */
    uint8_t bw                         : 2; /* BW */
    uint8_t lp_hp                      : 1; /* Power (LP == 0/HP == 1) */
    uint8_t qvar_en                    : 1; /* QVAR is enabled */
    uint8_t fs                         : 2; /* FS */
    uint8_t dec_ts                     : 2; /* Timestamp decimator value */
    uint8_t odr_xl_batch               : 1; /* Accelerometer ODR is batched */
    uint32_t timestamp;
  } cfg_chg;
} lis2duxs12_fifo_data_t;
int32_t lis2duxs12_fifo_data_get(lis2duxs12_ctx_t *ctx, lis2duxs12_md_t *md,
                                 lis2duxs12_fifo_mode_t *fmd,
                                 lis2duxs12_fifo_data_t *data);

typedef enum {
  LIS2DUXS12_NOTCH_50HZ       = 0x0,
  LIS2DUXS12_NOTCH_60HZ       = 0x1,
} lis2duxs12_ah_qvar_notch_t;

typedef enum {
  LIS2DUXS12_520MOhm          = 0x0,
  LIS2DUXS12_175MOhm          = 0x1,
  LIS2DUXS12_310MOhm          = 0x2,
  LIS2DUXS12_75MOhm           = 0x3,
} lis2duxs12_ah_qvar_zin_t;

typedef enum {
  LIS2DUXS12_GAIN_0_5         = 0x0,
  LIS2DUXS12_GAIN_1           = 0x1,
  LIS2DUXS12_GAIN_2           = 0x2,
  LIS2DUXS12_GAIN_4           = 0x3,
} lis2duxs12_ah_qvar_gain_t;

typedef struct {
  uint8_t ah_qvar_en                   : 1;
  uint8_t ah_qvar_notch_en             : 1;
  lis2duxs12_ah_qvar_notch_t ah_qvar_notch;
  lis2duxs12_ah_qvar_zin_t ah_qvar_zin;
  lis2duxs12_ah_qvar_gain_t ah_qvar_gain;
} lis2duxs12_ah_qvar_mode_t;
int32_t lis2duxs12_ah_qvar_mode_set(lis2duxs12_ctx_t *ctx,
                                    lis2duxs12_ah_qvar_mode_t val);
int32_t lis2duxs12_ah_qvar_mode_get(lis2duxs12_ctx_t *ctx,
                                    lis2duxs12_ah_qvar_mode_t *val);

typedef struct {
  uint8_t false_step_rej               : 1;
  uint8_t step_counter_enable          : 1;
  uint8_t step_counter_in_fifo         : 1;
} lis2duxs12_stpcnt_mode_t;
int32_t lis2duxs12_stpcnt_mode_set(lis2duxs12_ctx_t *ctx, lis2duxs12_stpcnt_mode_t val);
int32_t lis2duxs12_stpcnt_mode_get(lis2duxs12_ctx_t *ctx, lis2duxs12_stpcnt_mode_t *val);

int32_t lis2duxs12_stpcnt_steps_get(lis2duxs12_ctx_t *ctx, uint16_t *val);

int32_t lis2duxs12_stpcnt_rst_step_set(lis2duxs12_ctx_t *ctx);

int32_t lis2duxs12_stpcnt_debounce_set(lis2duxs12_ctx_t *ctx, uint8_t val);
int32_t lis2duxs12_stpcnt_debounce_get(lis2duxs12_ctx_t *ctx, uint8_t *val);

int32_t lis2duxs12_stpcnt_period_set(lis2duxs12_ctx_t *ctx, uint16_t val);
int32_t lis2duxs12_stpcnt_period_get(lis2duxs12_ctx_t *ctx, uint16_t *val);

