stm32duino/LIS2DUXS12/src/lis2duxs12_reg.h
int32_t lis2duxs12_fsm_start_address_set(lis2duxs12_ctx_t *ctx,
                                         uint16_t val);
int32_t lis2duxs12_fsm_start_address_get(lis2duxs12_ctx_t *ctx,
                                         uint16_t *val);

typedef enum {
  LIS2DUXS12_MLC_OFF                    = 0,
  LIS2DUXS12_MLC_ON                     = 1,
  LIS2DUXS12_MLC_ON_BEFORE_FSM          = 2,
} lis2duxs12_mlc_mode_t;
int32_t lis2duxs12_mlc_set(lis2duxs12_ctx_t *ctx, lis2duxs12_mlc_mode_t val);
int32_t lis2duxs12_mlc_get(lis2duxs12_ctx_t *ctx, lis2duxs12_mlc_mode_t *val);

int32_t lis2duxs12_mlc_status_get(lis2duxs12_ctx_t *ctx,
                                  lis2duxs12_mlc_status_mainpage_t *val);

int32_t lis2duxs12_mlc_out_get(lis2duxs12_ctx_t *ctx, uint8_t *buff);

typedef enum {
  LIS2DUXS12_ODR_PRGS_12Hz5 = 0,
  LIS2DUXS12_ODR_PRGS_25Hz  = 1,
  LIS2DUXS12_ODR_PRGS_50Hz  = 2,
  LIS2DUXS12_ODR_PRGS_100Hz = 3,
  LIS2DUXS12_ODR_PRGS_200Hz = 4,
} lis2duxs12_mlc_odr_val_t;
int32_t lis2duxs12_mlc_data_rate_set(lis2duxs12_ctx_t *ctx,
                                     lis2duxs12_mlc_odr_val_t val);
int32_t lis2duxs12_mlc_data_rate_get(lis2duxs12_ctx_t *ctx,
                                     lis2duxs12_mlc_odr_val_t *val);

int32_t lis2duxs12_mlc_fifo_en_set(lis2duxs12_ctx_t *ctx, uint8_t val);
int32_t lis2duxs12_mlc_fifo_en_get(lis2duxs12_ctx_t *ctx, uint8_t *val);

#ifdef __cplusplus
}
#endif

#endif /* LIS2DUXS12_REGS_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
